### Do it! 실습 | 조건에 맞는 데이터만 추출하기

In [1]:
import pandas as pd
exam = pd.read_csv("/Users/heohyeonjun/Desktop/We_IT_5th/weit/Data/exam.csv")
exam

    id  nclass  math  english  science
0    1       1    50       98       50
1    2       1    60       97       60
2    3       1    45       86       78
3    4       1    30       98       58
4    5       2    25       80       65
5    6       2    50       89       98
6    7       2    80       90       45
7    8       2    90       78       25
8    9       3    20       98       15
9   10       3    50       98       45
10  11       3    65       65       65
11  12       3    45       85       32
12  13       4    46       98       65
13  14       4    48       87       12
14  15       4    75       56       78
15  16       4    58       98       65
16  17       5    65       68       98
17  18       5    80       78       90
18  19       5    89       68       87
19  20       5    78       83       58

In [2]:
# exam에서 nclass가 1인 경우만 추출
exam.query('nclass == 1')

   id  nclass  math  english  science
0   1       1    50       98       50
1   2       1    60       97       60
2   3       1    45       86       78
3   4       1    30       98       58

In [3]:
# 2반인 경우만 추출
exam.query('nclass == 2')

   id  nclass  math  english  science
4   5       2    25       80       65
5   6       2    50       89       98
6   7       2    80       90       45
7   8       2    90       78       25

In [4]:
# 1번이 아닌 경우
exam.query('nclass!= 1')

    id  nclass  math  english  science
4    5       2    25       80       65
5    6       2    50       89       98
6    7       2    80       90       45
7    8       2    90       78       25
8    9       3    20       98       15
9   10       3    50       98       45
10  11       3    65       65       65
11  12       3    45       85       32
12  13       4    46       98       65
13  14       4    48       87       12
14  15       4    75       56       78
15  16       4    58       98       65
16  17       5    65       68       98
17  18       5    80       78       90
18  19       5    89       68       87
19  20       5    78       83       58

### Do it! 실습 | 초과, 미만, 이상, 이하 조건 걸기

In [5]:
# 수학 점수가 50점을 초과한 경우
exam.query('math > 50')

    id  nclass  math  english  science
1    2       1    60       97       60
6    7       2    80       90       45
7    8       2    90       78       25
10  11       3    65       65       65
14  15       4    75       56       78
15  16       4    58       98       65
16  17       5    65       68       98
17  18       5    80       78       90
18  19       5    89       68       87
19  20       5    78       83       58

In [6]:
# 수학 점수가 50점 미만인 경우
exam.query('math < 50')

    id  nclass  math  english  science
2    3       1    45       86       78
3    4       1    30       98       58
4    5       2    25       80       65
8    9       3    20       98       15
11  12       3    45       85       32
12  13       4    46       98       65
13  14       4    48       87       12

In [7]:
# 영어 점수가 50점 이상인 경우
exam.query('english >= 50')

    id  nclass  math  english  science
0    1       1    50       98       50
1    2       1    60       97       60
2    3       1    45       86       78
3    4       1    30       98       58
4    5       2    25       80       65
5    6       2    50       89       98
6    7       2    80       90       45
7    8       2    90       78       25
8    9       3    20       98       15
9   10       3    50       98       45
10  11       3    65       65       65
11  12       3    45       85       32
12  13       4    46       98       65
13  14       4    48       87       12
14  15       4    75       56       78
15  16       4    58       98       65
16  17       5    65       68       98
17  18       5    80       78       90
18  19       5    89       68       87
19  20       5    78       83       58

In [8]:
# 영어 점수가 80점 이하인 경우
exam.query('english <= 80')

    id  nclass  math  english  science
4    5       2    25       80       65
7    8       2    90       78       25
10  11       3    65       65       65
14  15       4    75       56       78
16  17       5    65       68       98
17  18       5    80       78       90
18  19       5    89       68       87

### Do it! 실습 | 여러 조건을 충족하는 행 추출하기

In [9]:
# 1반이면서 수학 점수가 50점인 경우
exam.query('nclass == 1 & math >= 50')

   id  nclass  math  english  science
0   1       1    50       98       50
1   2       1    60       97       60

In [10]:
# 2반이면서 영어 점수가 80점 이상인 경우
exam.query('nclass == 2 & english >= 80')

   id  nclass  math  english  science
4   5       2    25       80       65
5   6       2    50       89       98
6   7       2    80       90       45

### Do it! 실습 | 여러 조건 중 하나 이상 충족하는 행 추출하기

In [11]:
# 수학 점수가 90점 이상이거나 영어 점수가 90점 이상인 경우
exam.query('math >= 90 | english >= 90')

    id  nclass  math  english  science
0    1       1    50       98       50
1    2       1    60       97       60
3    4       1    30       98       58
6    7       2    80       90       45
7    8       2    90       78       25
8    9       3    20       98       15
9   10       3    50       98       45
12  13       4    46       98       65
15  16       4    58       98       65

In [12]:
# 영어 점수가 90점 미만이거나 과학 점수가 50점 미만인 경우
exam.query('english < 90 | math < 50')

    id  nclass  math  english  science
2    3       1    45       86       78
3    4       1    30       98       58
4    5       2    25       80       65
5    6       2    50       89       98
7    8       2    90       78       25
8    9       3    20       98       15
10  11       3    65       65       65
11  12       3    45       85       32
12  13       4    46       98       65
13  14       4    48       87       12
14  15       4    75       56       78
16  17       5    65       68       98
17  18       5    80       78       90
18  19       5    89       68       87
19  20       5    78       83       58

### Do it! 실습 | 목록에 해당하는 행 추출하기

In [13]:
# 1, 3, 5 반에 해당하면 추출
exam.query('nclass == 1 | nclass == 3 | nclass == 5')

    id  nclass  math  english  science
0    1       1    50       98       50
1    2       1    60       97       60
2    3       1    45       86       78
3    4       1    30       98       58
8    9       3    20       98       15
9   10       3    50       98       45
10  11       3    65       65       65
11  12       3    45       85       32
16  17       5    65       68       98
17  18       5    80       78       90
18  19       5    89       68       87
19  20       5    78       83       58

In [14]:
# 1, 3, 5반에 해당하면 추출
exam.query('nclass in [1, 3, 5]')

    id  nclass  math  english  science
0    1       1    50       98       50
1    2       1    60       97       60
2    3       1    45       86       78
3    4       1    30       98       58
8    9       3    20       98       15
9   10       3    50       98       45
10  11       3    65       65       65
11  12       3    45       85       32
16  17       5    65       68       98
17  18       5    80       78       90
18  19       5    89       68       87
19  20       5    78       83       58

### Do it! 실습 | 추출한 행으로 데이터 만들기

In [15]:
# nclass가 1인 행 추출해 nclass1에 할당
nclass1 = exam.query('nclass == 1')

# nclass가 2인 행 추출해 nclss2에 할당
nclass2 = exam.query('nclass == 2')

In [16]:
nclass1['math'].mean()

46.25

In [17]:
nclass2['math'].mean()

61.25

### Do it! 실습 | 문자 변수를 이용해 조건에 맞는 행 추출하기

In [18]:
df = pd.DataFrame({
    'sex' : ['F', 'M', 'F', 'M'],
    'country' : ['Korea', 'China', 'Japan', 'USA']
})
df

  sex country
0   F   Korea
1   M   China
2   F   Japan
3   M     USA

In [19]:
# 전체 조건에 작은따옴표, 추출할 문자에 큰따옴표 사용
df.query('sex == "F" & country == "Korea"')

  sex country
0   F   Korea

In [20]:
# 전체 조건에 큰 따옴표, 추출할 문자에 작은 따옴표 사용
df.query("sex == 'M' & country == 'China'")

  sex country
1   M   China

### mpg 데이터를 이용해 분석 문제를 해결해 보세요.

In [21]:
mpg = pd.read_csv("/Users/heohyeonjun/Desktop/We_IT_5th/weit/Data/mpg.csv")

#### Q1. 자동차 배기량에 따라 고속도로 연비가 다른지 알아보려고 한다. displ(배기량)이 4 이하인 자동차와 5 이상인 자동차 중 어떤 자동차의 hwy(고속도로 연비) 평균이 더 높은지 알아보자.

In [28]:
# displ(배기량)이 4이하인 자동차와 5이상인 자동차를 추출한다.
displ_under_4 = mpg.query("displ <= 4")
displ_under_5 = mpg.query("displ >= 5")

# 평균을 구하자.
under_4_mean = displ_under_4['hwy'].mean()
under_5_mean = displ_under_5['hwy'].mean()

18.07894736842105

#### Q2. 자동차 제조 회사에 따라 도시 연비가 어떻게 다른지 알아보려고 한다. 'audi와 'toyota'중 어느 manufacturer(자동차 제조 회사)의 cty(도시 연비) 평균이 더 높은지 알아보자.

In [34]:
# audi와 toyota 추출
audi = mpg.query('manufacturer == "audi"')
toyota = mpg.query('manufacturer == "toyota"')

In [35]:
# 도시 연비 구하기
audi['cty'].mean()

17.61111111111111

In [36]:
# 도시 연비 구하기
toyota['cty'].mean()

18.529411764705884

#### Q3. 'chevorlet, 'ford', 'honda' 자동차의 고속도로 연비 평균을 알아보려고 한다. 세 회사의 데이터를 추출한 다음 hwy 전체 평균을 구해보자.

In [39]:
cfh = mpg.query('manufacturer in ["chevorlet", "ford", "honda"]')
cfh['hwy'].mean()

22.852941176470587